abuckingham99.org
#+TITLE: My Emacs Customizations
#+AUTHOR: Andrew Buckingham
#+OPTIONS: num:nil toc:nil

* Who doesn't love packages?

#+BEGIN_SRC emacs-lisp
;;Who doesn't love packages?

(require 'package)
(add-to-list 'package-archives
             '("melpa" . "http://melpa.org/packages/") t)
(when (< emacs-major-version 24)
  ;; For important compatibility libraries like cl-lib
  (add-to-list 'package-archives '("gnu" . "http://elpa.gnu.org/packages/")))
(package-initialize) 
#+END_SRC

;; Load Packages
#+BEGIN_SRC emacs-lisp
(add-to-list 'load-path "~/.emacs.d/elpa/")
#+END_SRC

* Multiple Cursors

#+BEGIN_SRC emacs-lisp
;; Multiple Cursors
;; (Magnar is an Emacs god!)
;; https://github.com/magnars |http://www.emacsrocks.com 
(require 'multiple-cursors)
(global-set-key (kbd "C-S-c C-S-c") 'mc/edit-lines)
(global-set-key (kbd "C->") 'mc/mark-next-like-this)
(global-set-key (kbd "C-<") 'mc/mark-previous-like-this)
(global-set-key (kbd "C-c C->") 'mc/mark-all-words-like-this)
#+END_SRC

** Goal columns are useful!
#+BEGIN_SRC emacs-lisp
;; Goal columns are useful!
;; Enable set-goal-column
(put 'set-goal-column 'disabled nil)
#+END_SRC
   
* UI/UX Tweaks
#+BEGIN_SRC emacs-lisp
;; UI Tweaks
(if (fboundp 'scroll-bar-mode) (scroll-bar-mode -1))
(if (fboundp 'tool-bar-mode) (tool-bar-mode -1))
(if (fboundp 'fringe-mode) (fringe-mode -1))
#+END_SRC

** No splash screen on startup
#+BEGIN_SRC emacs-lisp
(setq inhibit-splash-screen t)
#+END_SRC

** I prefer a blank \*scratch\* buffer
#+BEGIN_SRC emacs-lisp
(setq initial-scratch-message nil)
#+END_SRC
** Just Y/N
#+BEGIN_SRC emacs-lisp
;; type "y"/"n" instead of "yes"/"no"
(fset 'yes-or-no-p 'y-or-n-p)
#+END_SRC
** Use Helm Mode
#+BEGIN_SRC emacs-lisp
;; Use Helm Mode
(helm-mode 1)
#+END_SRC
** Set up Helm Keyboard Shortcuts
#+BEGIN_SRC emacs-lisp
(global-set-key (kbd "C-x RET") 'helm-M-x)

(global-set-key (kbd "M-y") 'helm-show-kill-ring)

(global-set-key (kbd "C-x b") 'helm-mini)

(global-set-key (kbd "C-x C-f") 'helm-find-files)

(global-set-key (kbd "C-c h o") 'helm-occur)

(global-set-key (kbd "C-h SPC") 'helm-all-mark-rings)

(global-set-key (kbd "C-c h x") 'helm-register)

#+END_SRC

** Behold, the power of Powerline
#+BEGIN_SRC emacs-lisp
;;(require 'powerline)
#+END_SRC
** Use my webdev theme
#+BEGIN_SRC emacs-lisp
;; Use my webdev theme 
(load-theme 'webdev t)
#+END_SRC
* Set up my custom.el file
#+BEGIN_SRC emacs-lisp
;;Set up my custom.el file
(setq custom-file "~/.emacs.d/custom.el")
(load custom-file)
#+END_SRC
* Webdev
#+BEGIN_SRC emacs-lisp
;; Use web-mode whenever possible...
(setq auto-mode-alist (cons '("\\.html$" . web-mode) auto-mode-alist))
(setq auto-mode-alist (cons '("\\.aspx$" . web-mode) auto-mode-alist))
(setq auto-mode-alist (cons '("\\.erb$" . web-mode) auto-mode-alist))
(setq auto-mode-alist (cons '("\\.php$" . web-mode) auto-mode-alist))
#+END_SRC

* Byte Recompile
#+BEGIN_SRC emacs-lisp
;; Byte Recompile
(defun ab/byte-recompile ()
  (interactive)
  (byte-recompile-directory "~/.emacs.d" 0))
#+END_SRC
* Increment Number at Point

#+BEGIN_SRC emacs-lisp
;; Increment Number at Point
;;Got this from EmacsWiki; enables incremental numbers. First input
  ;; numbers and then use this!
  (defun ab/increment-number-at-point ()
      (interactive)
      (skip-chars-backward "0123456789")
      (or (looking-at "[0123456789]+")
          (error "No number at point"))
      (replace-match (number-to-string (1+ (string-to-number (match-string 0))))))
#+END_SRC
* Paren-Mode
#+BEGIN_SRC emacs-lisp
;; Paren-Mode
(require 'paren)
(show-paren-mode t)
#+END_SRC

* Because Alt-x is usually too awkward
#+BEGIN_SRC emacs-lisp
;; A great tip from Steve Yegge. Because Alt-x is too awkward...
;; (global-set-key "\C-x\C-m" 'execute-extended-command)
;; Experimenting with 'helm-M-x; see 'Helm Keyboard Shortcuts,' above
#+END_SRC

* Org-Mode 

** Require Org
#+BEGIN_SRC emacs-lisp
;; Require Org-Mode
(require 'org)
#+END_SRC

#+BEGIN_SRC emacs-lisp
;; It's more convenient to press 'Return' to follow a link from Org an C-c C-l.
(setq org-return-follows-link t)    
#+END_SRC

#+BEGIN_SRC emacs-lisp
;; Set up Org-Mode
(add-to-list 'auto-mode-alist '("\\.org\\’" . org-mode))
(global-set-key "\C-cl" 'org-store-link)
(global-set-key "\C-ca" 'org-agenda)
(global-set-key "\C-cb" 'org-iswitchb)
(setq org-log-done t)
#+END_SRC 

** Org-Mode Hooks
Make yasnippet work properly with org-mode. 
#+BEGIN_SRC emacs-lisp
;;  Make yasnippet work properly with org-mode. 
;;  (defun yas/org-very-safe-expand ()
;;    (let ((yas/fallback-behavior 'return-nil)) (yas/expand)))

(defun yas-org-very-safe-expand ()
  (let ((yas-fallback-behavior 'return-nil))
    (and (fboundp 'yas-expand) (yas-expand))))

(add-hook 'org-mode-hook
          (lambda ()
            (add-to-list 'org-tab-first-hook
                         'yas-org-very-safe-expand)
            ))

#+END_SRC

#+BEGIN_SRC emacs-lisp
  (add-hook 'org-mode-hook
            (lambda ()
              (local-set-key "\M-\C-n" 'outline-next-visible-heading)
              (local-set-key "\M-\C-p" 'outline-previous-visible-heading)
              (local-set-key "\M-\C-u" 'outline-up-heading)
              ;; table
              (local-set-key "\M-\C-w" 'org-table-copy-region)
              (local-set-key "\M-\C-y" 'org-table-paste-rectangle)
              (local-set-key "\M-\C-l" 'org-table-sort-lines)
              ;; display images
              (local-set-key "\M-I" 'org-toggle-iimage-in-org)
              ;; yasnippet (using the new org-cycle hooks)
              ;;(make-variable-buffer-local 'yas/trigger-key)
              ;;(setq yas/trigger-key [tab])
              ;;(add-to-list 'org-tab-first-hook 'yas/org-very-safe-expand)
              ;;(define-key yas/keymap [tab] 'yas/next-field)
              ))
#+END_SRC

** Speed keys
Speed commands enable single-letter commands in Org-mode files when
the point is at the beginning of a headline, or at the beginning of a
code block.

See the =org-speed-commands-default= variable for a list of the keys
and commands enabled at the beginning of headlines.  All code blocks
are available at the beginning of a code block, the following key
sequence =C-c C-v h= (bound to =org-babel-describe-bindings=) will
display a list of the code blocks commands and their related keys.

#+BEGIN_SRC emacs-lisp
  (setq org-use-speed-commands t)
#+END_SRC

** Code blocks
This activates a number of widely used languages, you are encouraged
to activate more languages using the customize interface for the
=org-babel-load-languages= variable, or with an elisp form like the
one below.  The customize interface of =org-babel-load-languages=
contains an up to date list of the currently supported languages.
#+BEGIN_SRC emacs-lisp
  ;; Org-Mode Code Blocks
    (org-babel-do-load-languages
     'org-babel-load-languages
     '((emacs-lisp . t)
       (sh . t)
       (R . t)
       (perl . t)
       (ruby . t)
       (python . t)
       (js . t)
       (haskell . t)))
#+END_SRC

The next block makes org-babel aware that a lower-case 'r' in a =src= block header should be processed as R. 

#+source: add-r
#+BEGIN_SRC emacs-lisp
  (add-to-list 'org-src-lang-modes
               '("r" . ess-mode))
#+END_SRC

** Code block fontification
   :PROPERTIES:
   :CUSTOM_ID: code-block-fontification
   :END:

The following displays the contents of code blocks in Org-mode files
using the major-mode of the code.  It also changes the behavior of
=TAB= to as if it were used in the appropriate major mode.  This means
that reading and editing code form inside of your Org-mode files is
much more like reading and editing of code using its major mode.
#+BEGIN_SRC emacs-lisp
;; Code block fontification
  (setq org-src-fontify-natively t)
  (setq org-src-tab-acts-natively t)
#+END_SRC

Don't ask for confirmation on every =C-c C-c= code-block compile. 

#+BEGIN_SRC emacs-lisp
;; Don't ask for confirmation on every =C-c C-c= code-block compile. 
  (setq org-confirm-babel-evaluate nil)
#+END_SRC

** Ensure the Latest Org-mode manual is in the info directory
By placing the =doc/= directory in Org-mode at the front of the
=Info-directory-list= we can be sure that the latest version of the
Org-mode manual is available to the =info= command (bound to =C-h i=).
#+BEGIN_SRC emacs-lisp
;; Ensure the Latest Org-mode manual is in the info directory
  (unless (boundp 'Info-directory-list)
    (setq Info-directory-list Info-default-directory-list))
  (setq Info-directory-list
        (cons (expand-file-name
               "doc"
               (expand-file-name
                "org"
                (expand-file-name "src" dotfiles-dir)))
              Info-directory-list))
#+END_SRC

** Nice Bulleted Lists
#+name: org-bullets
#+BEGIN_SRC emacs-lisp :tangle no
;; Nice Bulleted Lists
  (require 'org-bullets)
  (add-hook 'org-mode-hook (lambda () (org-bullets-mode 1)))
#+END_SRC

#+source: message-line
#+BEGIN_SRC emacs-lisp
;; It's silly, I know, but why not let Emacs greet me...? ;)
  (message "Welcome back, Andrew. Are you ready to save the world?")
#+END_SRC
** Org-Capture
#+BEGIN_SRC emacs-lisp
;; Let's keep our files in Dropbox
(setq org-directory "~/Dropbox/org")
(setq org-default-notes-file "~/Dropbox/org/refile.org")
(global-set-key (kbd "C-c c") 'org-capture)
#+END_SRC
* Just One Space
#+BEGIN_SRC emacs-lisp
;; Keybinding for just-one-space
;; recommended by Bozhidar: http://emacsredux.com/blog/2013/05/19/delete-whitespace-around-point/
(global-set-key (kbd "C-c j") 'just-one-space)
#+END_SRC

