abuckingham99.org
* Yasnippet
#+BEGIN_SRC emacs-lisp
(add-to-list 'load-path "~/.emacs.d/elpa/yasnippet")
    (require 'yasnippet) ;; not yasnippet-bundle
    (yas-global-mode 1)
#+END_SRC

#+BEGIN_SRC emacs-lisp
;; Load my snippets
(add-to-list 'load-path "~/.emacs.d/snippets/web-mode/")
(add-to-list 'load-path "~/.emacs.d/snippets/markdown-mode/")
(add-to-list 'load-path "~/.emacs.d/snippets/org-mode")
(add-to-list 'load-path "~/.emacs.d/snippets/ruby-mode")
#+END_SRC

#+BEGIN_SRC emacs-lisp
;;Load Popup-Snippets
(add-to-list 'load-path "~/.emacs.d/vendor/")

(require 'popup)
;; add some shotcuts in popup menu mode
(define-key popup-menu-keymap (kbd "M-n") 'popup-next)
(define-key popup-menu-keymap (kbd "TAB") 'popup-next)
(define-key popup-menu-keymap (kbd "<tab>") 'popup-next)
(define-key popup-menu-keymap (kbd "<backtab>") 'popup-previous)
(define-key popup-menu-keymap (kbd "M-p") 'popup-previous)

(defun yas/popup-isearch-prompt (prompt choices &optional display-fn)
  (when (featurep 'popup)
    (popup-menu*
     (mapcar
      (lambda (choice)
        (popup-make-item
         (or (and display-fn (funcall display-fn choice))
             choice)
         :value choice))
      choices)
     :prompt prompt
     ;; start isearch mode immediately
     :isearch t
     )))

(setq yas/prompt-functions '(yas/popup-isearch-prompt yas/no-prompt))
#+END_SRC

  
#+BEGIN_SRC emacs-lisp

  
  ;; This is on hold...not really using MobileOrg now, but might change my mind later...
  ;; (setq org-directory "~/Dropbox/org/")
  ;; (setq org-mobile-directory "~/Dropbox/Apps/MobileOrg/")
  ;; (setq org-agenda-files (quote ("~/Dropbox/org/its-2014-2.org")))
  ;; (setq org-mobile-inbox-for-pull "~/Dropbox/Apps/MobileOrg/inbox.org")
  
  (setq yas-snippet-dirs
        '("/Users/abuckingham99/.emacs.d/elpa/yasnippet-20140314.255/snippets/"
          "/Users/abuckingham99/.emacs.d/snippets/"
          ))
  (yas-global-mode 1) ;; or M-x yas-reload-all if you've started YASnippet already.
  
  ;; (add-to-list 'load-path
  ;;               "~/.emacs.d/snippets/html-mode/")

#+END_SRC
  
* Add Urban Dictionary to Webjump

#+BEGIN_SRC emacs-lisp
;; Set keyboard shortcut for webjump
(global-set-key (kbd "C-x g") 'webjump)

;; Add Urban Dictionary to webjump
(eval-after-load "webjump"
'(add-to-list 'webjump-sites
              '("Urban Dictionary" .
                [simple-query
                 "www.urbandictionary.com"
                 "http://www.urbandictionary.com/define.php?term="
                 ""])))
#+END_SRC

* Backups
#+BEGIN_SRC emacs-lisp


;; Write backup files to own directory
(setq backup-directory-alist
      `(("." . ,(expand-file-name
                 (concat user-emacs-directory "backups")))))

;; Make backups of files, even when they're in version control
(setq vc-make-backup-files t)

#+END_SRC

* Toggle Eshell Visor
#+BEGIN_SRC emacs-lisp
;;Source: http://rawsyntax.com/blog/learn-emacs-store-window-configuration/
(defun ab/toggle-eshell-visor ()
  "Brings up a visor like eshell buffer, filling the entire emacs frame"
  (interactive)
  (if (string= "eshell-mode" (eval 'major-mode))
      (jump-to-register :pre-eshell-visor-window-configuration)
    (window-configuration-to-register :pre-eshell-visor-window-configuration)
    (call-interactively 'eshell)
    (delete-other-windows)))

(global-set-key (kbd "C-c t") 'ab/toggle-eshell-visor)
#+END_SRC
* Browse Kill Ring
;; How many times has the kill ring saved my bacon...?
  (require 'browse-kill-ring)
* Ace Jump Mode
#+BEGIN_SRC emacs-lisp
(add-to-list 'load-path "~/.emacs.d/elpa/ace-jump-mode*/")
(autoload
  'ace-jump-mode
  "ace-jump-mode"
  "Emacs quick move minor mode"
  t)

(define-key global-map (kbd "C-c j") 'ace-jump-mode)

;; enable a more powerful jump back function from ace jump mode

(autoload
  'ace-jump-mode-pop-mark
  "ace-jump-mode"
  "Ace jump back:-)"
  t)

(eval-after-load "ace-jump-mode"
  '(ace-jump-mode-enable-mark-sync))
(define-key global-map (kbd "C-x SPC") 'ace-jump-mode-pop-mark)
#+END_SRC
* Require Dired-X
#+BEGIN_SRC emacs-lisp
;; Require Dired-X
(require 'dired-x)
#+END_SRC

* My Macros
